In [290]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns
import kagglehub as kh

## Data loading

In [291]:
df = pd.read_csv('Walmart.csv', encoding_errors='ignore')

df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,$74.69,7.0,05/01/19,13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,$15.28,5.0,08/03/19,10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,$46.33,7.0,03/03/19,13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,$58.22,8.0,27/01/19,20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,$86.31,7.0,08/02/19,10:37:00,Ewallet,5.3,0.48

In [292]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  object
 7   time            10051 non-null  object
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: float64(3), int64(1), object(7)
memory usage: 863.9+ KB

In [293]:
df.describe()

         invoice_id      quantity        rating  profit_margin
count  10051.000000  10020.000000  10051.000000   10051.000000
mean    5025.741220      2.353493      5.825659       0.393791
std     2901.174372      1.602658      1.763991       0.090669
min        1.000000      1.000000      3.000000       0.180000
25%     2513.500000      1.000000      4.000000       0.330000
50%     5026.000000      2.000000      6.000000       0.330000
75%     7538.500000      3.000000      7.000000       0.480000
max    10000.000000     10.000000     10.000000       0.570000

## data cleaning

In [294]:
df['time'] = pd.to_datetime(df['time'])
df['date'] = pd.to_datetime(df['date'])

C:\Users\4B\AppData\Local\Temp\ipykernel_8264\2363300744.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['time'] = pd.to_datetime(df['time'])
C:\Users\4B\AppData\Local\Temp\ipykernel_8264\2363300744.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['date'] = pd.to_datetime(df['date'])

In [295]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10051 entries, 0 to 10050
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      10051 non-null  int64
 1   Branch          10051 non-null  object
 2   City            10051 non-null  object
 3   category        10051 non-null  object
 4   unit_price      10020 non-null  object
 5   quantity        10020 non-null  float64
 6   date            10051 non-null  datetime64[ns]
 7   time            10051 non-null  datetime64[ns]
 8   payment_method  10051 non-null  object
 9   rating          10051 non-null  float64
 10  profit_margin   10051 non-null  float64
dtypes: datetime64[ns](2), float64(3), int64(1), object(5)
memory usage: 863.9+ KB

In [296]:
df['quantity'] = df['quantity'].fillna(0)

In [297]:
df['quantity'] = df['quantity'].astype(int)

In [298]:
df['quantity'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 10051 entries, 0 to 10050
Series name: quantity
Non-Null Count  Dtype
--------------  -----
10051 non-null  int64
dtypes: int64(1)
memory usage: 78.7 KB

In [299]:
df.duplicated().sum()

np.int64(51)

In [300]:
df.isnull().sum()

invoice_id         0
Branch             0
City               0
category           0
unit_price        31
quantity           0
date               0
time               0
payment_method     0
rating             0
profit_margin      0
dtype: int64

In [301]:
df.drop_duplicates(inplace=True)

In [302]:
df.dropna(inplace =True)

In [303]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9969 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      9969 non-null   int64
 1   Branch          9969 non-null   object
 2   City            9969 non-null   object
 3   category        9969 non-null   object
 4   unit_price      9969 non-null   object
 5   quantity        9969 non-null   int64
 6   date            9969 non-null   datetime64[ns]
 7   time            9969 non-null   datetime64[ns]
 8   payment_method  9969 non-null   object
 9   rating          9969 non-null   float64
 10  profit_margin   9969 non-null   float64
dtypes: datetime64[ns](2), float64(2), int64(2), object(5)
memory usage: 934.6+ KB

In [304]:
df.isnull().sum()

invoice_id        0
Branch            0
City              0
category          0
unit_price        0
quantity          0
date              0
time              0
payment_method    0
rating            0
profit_margin     0
dtype: int64

In [305]:
# convert the unit price to float 
df['unit_price'] = df['unit_price'].str.replace('$', '').astype(float)

In [306]:
df['unit_price'].dtypes

dtype('float64')

In [307]:
df.head()

,invoice_id,Branch,City,category,unit_price,quantity,date,time,payment_method,rating,profit_margin
0,1,WALM003,San Antonio,Health and beauty,74.69,7,2019-05-01,2025-02-22 13:08:00,Ewallet,9.1,0.48
1,2,WALM048,Harlingen,Electronic accessories,15.28,5,2019-08-03,2025-02-22 10:29:00,Cash,9.6,0.48
2,3,WALM067,Haltom City,Home and lifestyle,46.33,7,2019-03-03,2025-02-22 13:23:00,Credit card,7.4,0.33
3,4,WALM064,Bedford,Health and beauty,58.22,8,2019-01-27,2025-02-22 20:33:00,Ewallet,8.4,0.33
4,5,WALM013,Irving,Sports and travel,86.31,7,2019-08-02,2025-02-22 10:37:00,Ewallet,5.3,0.48

In [308]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9969 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      9969 non-null   int64
 1   Branch          9969 non-null   object
 2   City            9969 non-null   object
 3   category        9969 non-null   object
 4   unit_price      9969 non-null   float64
 5   quantity        9969 non-null   int64
 6   date            9969 non-null   datetime64[ns]
 7   time            9969 non-null   datetime64[ns]
 8   payment_method  9969 non-null   object
 9   rating          9969 non-null   float64
 10  profit_margin   9969 non-null   float64
dtypes: datetime64[ns](2), float64(3), int64(2), object(4)
memory usage: 934.6+ KB

In [309]:
df['total_price'] = df['unit_price'] * df['quantity']

In [310]:
df['total_price'].head()

0    522.83
1     76.40
2    324.31
3    465.76
4    604.17
Name: total_price, dtype: float64

In [311]:
df['payment_method'].value_counts()

payment_method
Credit card    4256
Ewallet        3881
Cash           1832
Name: count, dtype: int64

In [312]:
# how many branch we have 
df['Branch'].count()

np.int64(9969)

## Data exploration (EDA)

### Qu1 : Find diffreent payment method and number of transaction, number of quantity sold

In [313]:
df.groupby('payment_method')['quantity'].sum().sort_values(ascending=False)

payment_method
Credit card    9567
Ewallet        8932
Cash           4984
Name: quantity, dtype: int64

### Q.2 : 
- Identify the highest-rated category in each branche, displaying the branche, category.
- AVG rating

In [314]:
highest_rated_categorie = df.loc[df.groupby('Branch')['rating'].idxmax(), ['Branch','rating', 'category']]
highest_rated_categorie

       Branch  rating                category
583   WALM001     9.5     Fashion accessories
391   WALM002     9.7     Fashion accessories
194   WALM003     9.9  Electronic accessories
98    WALM004     9.3      Food and beverages
370   WALM005     9.9  Electronic accessories
...       ...     ...                     ...
376   WALM096     9.6      Home and lifestyle
544   WALM097     9.2      Food and beverages
798   WALM098     9.8       Health and beauty
1020  WALM099     9.0      Home and lifestyle
1874  WALM100     9.0      Home and lifestyle

[100 rows x 3 columns]

In [315]:
# avg rating
print(df['rating'].mean())

5.828839402146654

### Q.3 identify the busiest day for each branch based on the number of transaction

In [327]:
df['date'] = df['date'].dt.day_name()

busiest_day = df.groupby(['Branch', 'date']).size().reset_index(name="transaction_count")

busiest_day = busiest_day.loc[busiest_day.groupby('Branch')['transaction_count'].idxmax().sort_values(ascending=False)]

busiest_day.head()

      Branch      date  transaction_count
697  WALM100  Thursday                 12
689  WALM099    Sunday                 33
680  WALM098    Monday                 14
672  WALM097    Friday                 14
670  WALM096   Tuesday                 15

### Q.4 Calculate the total quantity of items sold per payment method. list payment_method and total_quantity.

In [317]:
tot_qty_sold_per_payment = df.groupby('payment_method')['quantity'].sum().reset_index()
tot_qty_sold_per_payment.columns = ['payment_method', 'total_quantity']
tot_qty_sold_per_payment

  payment_method  total_quantity
0           Cash            4984
1    Credit card            9567
2        Ewallet            8932

### Q.5 determine the average, minimum, and maximum rating of products fro each city. List the city, average_rating, min_rating,and max_rating

In [318]:
city_rating = df.groupby('City')['rating'].agg(
    average_rating = "mean",
    minimum_rating = "min",
    maximum_rating = "max"
).reset_index()

city_rating

           City  average_rating  minimum_rating  maximum_rating
0       Abilene        6.336111             4.0             9.7
1         Alamo        6.595588             3.0            10.0
2         Alice        6.164179             3.0             9.2
3         Allen        6.389041             3.0             9.0
4      Amarillo        6.542308             3.0             9.0
..          ...             ...             ...             ...
93     Victoria        5.119205             3.0             9.5
94         Waco        5.385000             3.0             9.3
95   Waxahachie        5.215079             3.0             9.5
96  Weatherford        5.084242             3.0             9.0
97      Weslaco        5.180808             3.0             9.8

[98 rows x 4 columns]

### Q.6 calculate the total profit for each category by considering total_profit as (unit_price * quantity * profit_margin). List category and total_profit, ordered from highest to lowest profits.

In [319]:
# here i create another column to store the total profit
df["total_profits"] = df['unit_price'] * df['quantity'] * df['profit_margin']

In [320]:
tot_profit_category = df.groupby('category')['total_profits'].sum().reset_index()
tot_profit_category = tot_profit_category.sort_values(by="total_profits", ascending=False)

tot_profit_category

                 category  total_profits
1     Fashion accessories    192314.8932
4      Home and lifestyle    192213.6381
0  Electronic accessories     30772.4895
2      Food and beverages     21552.8622
5       Sports and travel     20613.8082
3       Health and beauty     18671.7345

### Q.7 - determine the mosty common payment method for each branch - display branch and the preferred_payment_method.

In [321]:
mst_cmn_pym_method = df.groupby('Branch')['payment_method'].agg(lambda x: x.value_counts().idxmax()).reset_index()
mst_cmn_pym_method.columns = ['Branch', "Preferred_payment_method"]
mst_cmn_pym_method

     Branch Preferred_payment_method
0   WALM001                  Ewallet
1   WALM002                  Ewallet
2   WALM003              Credit card
3   WALM004                  Ewallet
4   WALM005                  Ewallet
..      ...                      ...
95  WALM096                  Ewallet
96  WALM097                  Ewallet
97  WALM098                  Ewallet
98  WALM099              Credit card
99  WALM100                  Ewallet

[100 rows x 2 columns]

### Q.8 categorize sales into 3 groups mornign, afternoon and evening, Find out each of the shift and number of invoices

In [322]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9969 entries, 0 to 9999
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   invoice_id      9969 non-null   int64
 1   Branch          9969 non-null   object
 2   City            9969 non-null   object
 3   category        9969 non-null   object
 4   unit_price      9969 non-null   float64
 5   quantity        9969 non-null   int64
 6   date            9969 non-null   datetime64[ns]
 7   time            9969 non-null   datetime64[ns]
 8   payment_method  9969 non-null   object
 9   rating          9969 non-null   float64
 10  profit_margin   9969 non-null   float64
 11  total_price     9969 non-null   float64
 12  total_profits   9969 non-null   float64
dtypes: datetime64[ns](2), float64(5), int64(2), object(4)
memory usage: 1.3+ MB

In [323]:
# extract the hour from the time column
df['hour'] = df['time'].dt.hour

# define the shift categorize
def categorize_shift(hour):
    if  6<= hour < 12:
        return "Morning"
    elif 12 <= hour < 18:
        return 'Afternoon'
    else:
        return "Evening"
    
# apply the function to create a new column

df['shift'] = df['hour'].apply(categorize_shift)

# count the number of incvoices per shift

shift_invoice_count = df.groupby('shift')['invoice_id'].nunique().reset_index()

# rename the column to more clarity

shift_invoice_count.columns = ['shift', 'num_invoices']

# sort shifts in a logical order
shift_invoice_count = shift_invoice_count.set_index('shift').loc[["Morning", "Afternoon", "Evening"]].reset_index()

shift_invoice_count

       shift  num_invoices
0    Morning          2087
1  Afternoon          4636
2    Evening          3246

In [324]:
df['hour'] = df['time'].dt.hour
 
def categorize_shift(hour):
    if  6<= hour<12:
        return "Morning"
    elif 12 <= hour <18:
        return "Afternoon" 
    else:
        return "Evening"
    
df['hour'] = df['hour'].apply(categorize_shift)

shift_invoice_count = df.groupby('shift')['invoice_id'].nunique().reset_index()

shift_invoice_count.columns = ['shift', 'invoices_count']

shift_invoice_count = shift_invoice_count.set_index('shift').loc[['Morning', 'Afternoon', 'Evening']].reset_index()

shift_invoice_count

       shift  invoices_count
0    Morning            2087
1  Afternoon            4636
2    Evening            3246

Explanation:
Extract Hour → df["hour"] = df["time"].dt.hour

Extracts the hour from the time column (assuming it's a datetime type).
Categorize Time into Shifts:

Morning → 6 AM to 11:59 AM
Afternoon → 12 PM to 5:59 PM
Evening → 6 PM to 5:59 AM (wraps around midnight)
Count Invoices → df.groupby("shift")["invoice_id"].nunique()

Counts unique invoices for each shift.
Sorting Shifts → Ensures the order is logically Morning → Afternoon → Evening.

### Q.9 identify 5 branch with highest decrease ratio in, Revenue compare to last year(current year 2023 and last year 2022)

steps:

Filter data for both years (2022 and 2023).
Calculate total revenue for each branch in both years.
Compute the percentage decrease.
Sort and get the top 5 branches with the highest revenue drop.

In [325]:
# ensure the data column is in datetime format

df['date'] = pd.to_datetime(df['date'])

# extract the year 
df['year'] = df['date'].dt.year


# calculate total revernue per brach for each year

rev_per_year = df.groupby(["Branch", "year"])["total_price"].sum().unstack()
# for more clarity
rev_per_year = rev_per_year[[2022, 2023]] 
rev_per_year.columns = ["revenue_2022", "revenue_2023"]
# remove the blank rows
rev_per_year = rev_per_year.dropna()

# calculate the percentage decrease in revenue

rev_per_year["decrease_ratio"] = ((rev_per_year['revenue_2022'] - rev_per_year['revenue_2023'])/rev_per_year['revenue_2022']) * 100

# get the 5 braches with the highest decrease ratio

top_5_branches = rev_per_year.sort_values(by='decrease_ratio', ascending=False).head(5)


top_5_branches

         revenue_2022  revenue_2023  decrease_ratio
Branch
WALM045        1731.0         647.0       62.622761
WALM047        2581.0        1069.0       58.581945
WALM098        2446.0        1030.0       57.890433
WALM033        2099.0         931.0       55.645545
WALM081        1723.0         850.0       50.667441

🔍 Explanation:
Convert date to datetime → Ensures we can extract the year.
Extract year into a new column (year).
Calculate total revenue per branch per year → groupby(["Branch", "year"])["total_price"].sum()
Unstack to get separate columns for 2022 & 2023 revenue.
Drop branches with missing data → Ensures we compare only valid cases.
Calculate the revenue decrease ratio:

- decrease_ratio = ((revenue_2022 - revenue_2023)/revenue_2023) * 100

Sort by highest decrease ratio and select the top 5 branches.

# export dataframes

In [328]:
highest_rated_categorie.to_csv("highest_rated_categorie.csv", index=False)
busiest_day.to_csv("busiest_day.csv", index=False)
tot_qty_sold_per_payment.to_csv("tot_qty_sold_per_payment.csv", index=False)
city_rating.to_csv("city_rating.csv", index=False)
tot_profit_category.to_csv("tot_profit_category.csv", index=False)
mst_cmn_pym_method.to_csv("mst_cmn_pym_method.csv", index=False)
shift_invoice_count.to_csv("shift_invoice_count.csv", index=False)
top_5_branches.to_csv("top_5_branches.csv", index=False)